Revit 2026 API

# DimensionName Property

---

Retrieves or changes the name associated with the Dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; set; }
```
```vb
Public Property Name As String
	Get
	Set
```
```cpp
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Name : string with get, set
```

#### Property Value

String

The property inherited from element is hidden, a System.InvalidOperationException is thrown.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace